In [9]:
import pandas as pd

In [7]:
pd.read_csv('Book1.csv')

     Nombre  Apellido  Edad
0      Juan     Nunoz    22
1      Alex  Martinez    17
2    Andres      Cruz    18
3  Edinson    Viveros    35

In [12]:
frame_data = {
    'Nombre': ['Juan', 'Alex', 'Andres', 'Edinson'],
    'Apellido': ['Nunoz', 'Martinez', 'Cruz', 'Viveros'],
    'Edad': [22, 17, 18, 35],
    'Trabajo': ['Bibliotecario', 'Florista', 'Enfermero', 'Conserje']
}
frame_data

{'Nombre': ['Juan', 'Alex', 'Andres', 'Edinson'],
 'Apellido': ['Nunoz', 'Martinez', 'Cruz', 'Viveros'],
 'Edad': [22, 17, 18, 35],
 'Trabajo': ['Bibliotecario', 'Florista', 'Enfermero', 'Conserje']}

In [13]:
df = pd.DataFrame(frame_data)
df

    Nombre  Apellido  Edad        Trabajo
0     Juan     Nunoz    22  Bibliotecario
1     Alex  Martinez    17       Florista
2   Andres      Cruz    18      Enfermero
3  Edinson   Viveros    35       Conserje